Exercises/2.WebServices/ex1/soaprequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:Multiply xmlns:m="http://tempuri.org/">
			<m:intA>4</m:intA>
			<m:intB>2</m:intB>
		</m:Multiply>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
