src/main/resources/templates/divide-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
     <tem:Divide>
         <tem:intA>${headers.num1}</tem:intA>
         <tem:intB>${headers.num2}</tem:intB>
    </tem:Divide>
   </soapenv:Body>
</soapenv:Envelope>