src/test/resources/soapRequests/subtract.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:Subtract>
            <tem:intA>10</tem:intA>
            <tem:intB>5</tem:intB>
        </tem:Subtract>
    </soapenv:Body>
</soapenv:Envelope>