soapcalladd

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>100</intA>
      <intB>100</intB>
    </Add>
  </soap12:Body>
</soap12:Envelope>
